--1a SKK 

--(𝜆𝑥𝑦𝑧.𝑥𝑧(𝑦𝑧))(𝜆𝑥𝑦.𝑥)(𝜆𝑥𝑦.𝑥)

--(𝜆𝑦𝑧.(𝜆𝑥𝑦.𝑥)𝑧(𝑦𝑧))(𝜆𝑥𝑦.𝑥)

--(𝜆𝑦𝑧.(𝑦𝑧))(𝜆𝑥𝑦.𝑥)

--(𝜆𝑧.(𝜆𝑥𝑦.𝑥)𝑧)

---------------------------- 

--1b SIK 

--(𝜆𝑥𝑦𝑧.𝑥𝑧(𝑦𝑧))(𝜆𝑥.𝑥)(𝜆𝑥𝑦.𝑥)

--(𝜆𝑦𝑧.(𝜆𝑥.𝑥)𝑧(𝑦𝑧))(𝜆𝑥𝑦.𝑥)

--(𝜆𝑦𝑧.(𝑧))(𝜆𝑥𝑦.𝑥)

--(𝜆𝑧.𝑧)

---------------------------- 

--1c SSS

--(𝜆𝑥𝑦𝑧.𝑥𝑧(𝑦𝑧))(𝜆𝑥𝑦𝑧.𝑥𝑧(𝑦𝑧))

--(𝜆𝑦𝑧.(𝜆𝑥𝑦𝑧.𝑥𝑧(𝑦𝑧))𝑧((𝜆𝑥𝑦𝑧.𝑥𝑧(𝑦𝑧))𝑧(𝑦𝑧)))

--(𝜆𝑦𝑧.(𝜆𝑦𝑧.𝑧(𝑧))𝑧((𝜆𝑥𝑦𝑧.𝑥𝑧(𝑦𝑧))𝑧(𝑦𝑧)))

--(𝜆𝑦𝑧.(𝜆𝑦𝑧.𝑧(𝑧))𝑧((𝜆𝑧.𝑧(𝑧))𝑧(𝑦𝑧)))

--(𝜆𝑧.(𝜆𝑧.𝑧(𝑧))𝑧(𝑧(𝑧)))

--(𝜆𝑧.𝑧(𝑧(𝑧)))

--2a

--𝑊𝑊 = (𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦) (𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦)

--(𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦)[𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦/𝑥] 𝜆𝑦.𝑥𝑦𝑦 
--𝜆𝑦.(𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦) 𝑦𝑦𝑦

--(𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦) 𝑦𝑦𝑦
--(𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦)[𝑦𝑦𝑦/𝑥] 𝑦𝑦𝑦𝑦𝑦
--𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 𝑦𝑦𝑦

--2b

--𝑊𝑊𝑊 = (𝑊𝑊) (𝑊𝑊)
--((𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦) 𝑦𝑦𝑦) ((𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦) 𝑦𝑦𝑦)

--((𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦) 𝑦𝑦𝑦) ((𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦) 𝑦𝑦𝑦)
--(𝜆𝑦.𝑦𝑦𝑦𝑦𝑦) ((𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦) 𝑦𝑦𝑦)

--(𝜆𝑦.𝑦𝑦𝑦𝑦𝑦) ((𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦) 𝑦𝑦𝑦)
--(𝜆𝑦.𝑦𝑦𝑦𝑦𝑦) (𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 𝑦𝑦𝑦)

--(𝜆𝑦.𝑦𝑦𝑦𝑦𝑦) (𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 𝑦𝑦𝑦)
--𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 (𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 𝑦𝑦𝑦)

--𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 (𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 𝑦𝑦𝑦)
--𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 (𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 𝑦𝑦𝑦)

--((𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦) 𝑦𝑦𝑦) ((𝜆𝑥.𝜆𝑦.𝑥𝑦𝑦) 𝑦𝑦𝑦) → 𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 (𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 𝑦𝑦𝑦) → 𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 (𝜆𝑦.𝑦𝑦𝑦𝑦𝑦 𝑦𝑦𝑦) → ... (infinite expansion)