--1a 
(𝜆𝑦.𝑡𝑟𝑢𝑒(𝑦 𝑦 𝑦) 𝑡𝑟𝑢𝑒)

--1b
𝐹 𝑡𝑟𝑢𝑒 𝑓𝑎𝑙𝑠𝑒 = (𝜆𝑦.𝑡𝑟𝑢𝑒(𝑓𝑎𝑙𝑠𝑒 𝑓𝑎𝑙𝑠𝑒 𝑓𝑎𝑙𝑠𝑒) 𝑡𝑟𝑢𝑒)
𝐹 𝑓𝑎𝑙𝑠𝑒 𝑡𝑟𝑢𝑒 = (𝜆𝑦.𝑓𝑎𝑙𝑠𝑒(𝑡𝑟𝑢𝑒 𝑡𝑟𝑢𝑒 𝑡𝑟𝑢𝑒) 𝑓𝑎𝑙𝑠𝑒)
𝐹 𝑓𝑎𝑙𝑠𝑒 𝑓𝑎𝑙𝑠𝑒 = (𝜆𝑦.𝑓𝑎𝑙𝑠𝑒(𝑓𝑎𝑙𝑠𝑒 𝑓𝑎𝑙𝑠𝑒 𝑓𝑎𝑙𝑠𝑒) 𝑓𝑎𝑙𝑠𝑒)

--1c
𝐹 𝑡𝑟𝑢𝑒 𝑡𝑟𝑢𝑒 = (𝜆𝑦.𝑡𝑟𝑢𝑒(𝑡𝑟𝑢𝑒 𝑡𝑟𝑢𝑒 𝑡𝑟𝑢𝑒) 𝑡𝑟𝑢𝑒) = 𝑡𝑟𝑢𝑒
𝐹 𝑡𝑟𝑢𝑒 𝑓𝑎𝑙𝑠𝑒 = (𝜆𝑦.𝑡𝑟𝑢𝑒(𝑡𝑟𝑢𝑒 𝑡𝑟𝑢𝑒 𝑡𝑟𝑢𝑒) 𝑡𝑟𝑢𝑒) = 𝑡𝑟𝑢𝑒
𝐹 𝑓𝑎𝑙𝑠𝑒 𝑡𝑟𝑢𝑒 = (𝜆𝑦.𝑓𝑎𝑙𝑠𝑒(𝑡𝑟𝑢𝑒 𝑡𝑟𝑢𝑒 𝑡𝑟𝑢𝑒) 𝑓𝑎𝑙𝑠𝑒) = 𝑓𝑎𝑙𝑠𝑒
𝐹 𝑓𝑎𝑙𝑠𝑒 𝑓𝑎𝑙𝑠𝑒 = (𝜆𝑦.𝑓𝑎𝑙𝑠𝑒(𝑓𝑎𝑙𝑠𝑒 𝑓𝑎𝑙𝑠𝑒 𝑓𝑎𝑙𝑠𝑒) 𝑓𝑎𝑙𝑠𝑒) = 𝑓𝑎𝑙𝑠𝑒

F returns the same value that it is applied to


--2a
(𝜆𝑓.𝜆𝑥.𝑓(𝑠𝑢𝑐𝑐𝑒𝑠𝑠𝑜𝑟𝑓𝑥)) ≡ (𝜆𝑓.𝜆𝑥.𝑓(𝑠𝑢𝑐𝑐𝑒𝑠𝑠𝑜𝑟𝑓𝑥))


--2b
(𝜆𝑥.𝟸(𝜆𝑥.𝑥(𝑥(𝑛𝑛𝑥)))𝑥)


--2c
𝚖𝚞𝚕𝚝 𝟸 𝟸 is (𝜆𝑥.𝟸(𝟸(𝜆𝑥.𝑥(𝑥(𝑛𝑛(𝑛𝑛𝑥))))𝑥)